[
    {
        "title": "Personal Server",
        "description": "Converted my PC into an Ubuntu Server to host my website and other public and private applications. Connected to the internet via a cloudflared tunnel with WARP for ssh access for remote deployments.",
        "tech": ["Cloudflare","Networking","Nginx"],
        "status": "Launched",
        "path": "server",
        "content": "# Overview\n\nThis project is my personal server made from an old PC running Ubuntu Server. It is connected to the internet via a cloudflared tunnel and accessable only through http requests to davidjonathanlewis.com. SSH access is acheived through devices enrolled my Cloudflare WARP network for maximum security and managed SSH access.\n\n---\n\n## Problem\n\nI have no way of hosting my applications and projects for the internet and recruiters to see. I considered cloud hosting with AWS or similar, but that wouldn't allow me to be as creative with what I build and wouldn't alow me full access to manage the server. Additionally, I learned how to use cloudflare for more advanced features than deploying by hosting my own server. \n\n---\n\n## Key motivations\n\n- Maintain full control over hosting and infrastructure\n- Demonstrate secure public exposure without opening inbound ports\n- Integrate live projects securely accessable on the internet\n\n---\n\n## Challenges\n\n- **Secure public access**  \n  Solved using Cloudflare Tunnel to provide encrypted ingress and access control.\n\n- **Tracking project uptime and status**  \n  Implemented periodic health checks with timeout handling and status caching.\n\n- **Users and Scaling\n**  The biggest downside to self hosting is I am limited by my hardware. However, this limitation will force me to be creative and program efficiently, and shouldn't be a forseeable problem for a long time. \n\n---\n\n## Results & Impact\n\n- Fully deployed personal server with controlled internet access\n- Reliable public access\n- Platform capable of showcasing both completed and active projects\n- Demonstrates practical experience with:\n  - Linux Server administration\n  - Networking and security\n\n---\n\n## What I Learned\n\n- Secure networking practices for self-hosted services\n- Importance of monitoring and uptime visibility\n- Networking through and with Cloudflare\n\n---\n\n## Future Work\n\n- Expanded monitoring and alerting\n- Robust logging\n\n---"
    }, 

    {
        "title": "Personal Website",
        "description": "My personal website (this one right now). Includes a platform to showcase technical projects, live status information for deployed projects, and information about me.",
        "tech": ["React","Teailwind"],
        "status": "Development",
        "path": "personal-website",
        "github": "https://github.com/JMANY42/personal-website",
        "demo": "https://davidjonathanlewis.com",
        "content": "# Overview\n\nThis project is my personal website, built to serve as a professional portfolio for applications and a platform to showcase technical projects. In addition to static portfolio content, the site includes live status information for deployed projects, demonstrating real-world hosting, monitoring, and operations experience.\n\nThe website is self-hosted on a server running in my apartment and securely exposed to the internet using a Cloudflare Tunnel. This design prioritizes security, control, and hands-on infrastructure experience over managed hosting platforms.\n\nChanges to the production, staging, and dev version of the website are automatically deployed to my server via a secure github automation. \n\n---\n\n## Problem\n\nMost portfolio websites are fully static and hosted on managed platforms, which limits opportunities to demonstrate systems, networking, and deployment experience. The goal of this project was to build a portfolio that not only presents work but also *is itself* a production system.\n\n---\n\n## Key motivations\n\n- Show off my Projects with a Project\n- Maintain full control over hosting and infrastructure\n- Demonstrate secure public exposure without opening inbound ports\n- Integrate live project status and uptime data\n- Ease of modification to add display future projects\n\n---\n\n## High-Level Architecture\n\n**Frontend\n**- React-based single-page application\n- Component-driven layout for easy updates and expansion\n- Static biographical content embedded directly in the frontend\n\n**Backend\n**- Lightweight API for serving project data and status information\n- Other services to come as needed\n\n**Infrastructure\n**- Self-hosted Linux server\n- Cloudflare Tunnel for secure ingress\n- No direct public SSH or exposed ports\n- Reverse proxy for serving frontend and API traffic\n\n---\n\n## Challenges\n\n- **Secure public access**  \n  Solved using Cloudflare Tunnel to provide encrypted ingress and access control.\n\n- **Tracking project uptime and status**  \n  Implemented periodic health checks with timeout handling and status caching.\n\n- **Balancing static and dynamic content**  \n  Static bio data is embedded in the frontend, while project data is served dynamically to allow live updates.\n\n---\n\n## Results & Impact\n\n- Fully deployed personal website with live project data\n- Reliable public access\n- Platform capable of showcasing both completed and active projects\n- Demonstrates practical experience with:\n  - Web Dev\n  - Linux servers\n  - Networking and security\n\n---\n\n## What I Learned\n\n- Differences between local development and production environments\n- Better understanding of web server architecture \n- Importance of monitoring and uptime visibility\n- Designing systems with future expansion in mind\n\n---\n\n## Future Work\n\n- Expanded monitoring and alerting\n- Admin interface for managing project data\n- Technical blog or write-up section\n- Improved mobile responsiveness and UI polish\n\n---"
    }
]